1111-SORT-PARA.                  
      SORT WORK-FILE               
         ON ASCENDING KEY W-EMP-ID 
            USING EMP-FILE-IN      
            GIVING EMPLOYEE-FILE.  

==============================================
COBOL PROGRAM

ENVIRONMENT DIVISION.                       
 INPUT-OUTPUT SECTION.                       
 FILE-CONTROL.                               
     SELECT EMP-FILE-IN   ASSIGN TO EMPINPUT.
     SELECT WORK-FILE     ASSIGN TO WRKFILE. 
     SELECT EMPLOYEE-FILE ASSIGN TO EMPFILE  
        ORGANIZATION IS SEQUENTIAL           
        ACCESS MODE  IS SEQUENTIAL           
        FILE STATUS  IS WS-EMP-STAT.         
     SELECT REPORT-FILE ASSIGN TO REPFILE    
        ORGANIZATION IS SEQUENTIAL           
        ACCESS MODE  IS SEQUENTIAL           
        FILE STATUS  IS WS-REP-STAT.         
 DATA DIVISION.                              
 FILE SECTION.                               
 FD  EMP-FILE-IN                             
     RECORD CONTAINS 50 CHARACTERS           
     RECORDING MODE IS F.                    
01	EMP-RECORD.                             
     03  IN-EMP-ID       PIC X(05).
     03  FILLER          PIC X(45).
SD  WORK-FILE.                    
 01  WORK-RECORD.                  
     03  W-EMP-ID        PIC X(05).
     03  FILLER          PIC X(45).
FD  EMPLOYEE-FILE                 
     RECORD CONTAINS 50 CHARACTERS 
     RECORDING MODE IS F.          
     COPY EMPREC.                  
 FD  REPORT-FILE                   
     RECORD CONTAINS 80 CHARACTERS 
     RECORDING MODE IS F.          
 01  REPORT-RECORD PIC X(80).      

COBRUN JCL

//DSRP001X JOB CLASS=A,NOTIFY=&SYSUID,MSGCLASS=X,   
//          MSGLEVEL=(1,1),TIME=(0,2)               
//*                                                 
//STEP010  EXEC PGM=PROG13                          
//STEPLIB  DD  DSN=DSRP001.COBOL.LOADLIB,DISP=SHR   
//EMPINPUT DD  DSN=DSRP001.COBOL.EMPFILE,DISP=SHR   
//         DD  DSN=DSRP001.COBOL.EMPFILE2,DISP=SHR  
//         DD  DSN=DSRP001.COBOL.EMPFILE5,DISP=SHR  
//WRKFILE  DD  UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE)    
//EMPFILE  DD  DSN=&&TEMP,DISP=(NEW,PASS),          
//             SPACE=(TRK,(1,1),RLSE),              
//             DCB=(RECFM=FB,LRECL=50,BLKSIZE=25000)
//REPFILE  DD  DSN=DSRP001.COBOL.REPORT,DISP=OLD    
//SYSOUT   DD  SYSOUT=*,OUTLIM=500           
