 IDENTIFICATION DIVISION.
 PROGRAM-ID. FH05.
 ENVIRONMENT DIVISION.
 INPUT-OUTPUT SECTION.
*
 FILE-CONTROL.
      SELECT EMP-FILE      ASSIGN TO 'INPUTSORT.DAT'.
      SELECT WORK-FILE     ASSIGN TO 'WRKFILE.DAT'.
      SELECT EMPLOYEE-FILE ASSIGN TO 'EMPFILE.DAT'
      FILE STATUS IS WS-EMP-STAT.
      SELECT REPORT-FILE   ASSIGN TO 'REPFILE.REP' 
      FILE STATUS IS WS-OUT-STAT.
*
 DATA DIVISION.
 FILE SECTION.
 
 FD  EMP-FILE
     RECORD CONTAINS 50 CHARACTERS
     RECORDING MODE IS F.
 01  EMP-RECORD.
     03  FILLER           PIC X(20).
     03  IN-EMP-LOC       PIC X(03).
     03  FILLER           PIC X(27).
     
 SD  WORK-FILE.
 01  WORK-RECORD.
     03  FILLER           PIC X(20).
     03  W-EMP-LOC        PIC X(03).
     03  FILLER           PIC X(27).
     
 FD  EMPLOYEE-FILE
     RECORD CONTAINS 50 CHARACTERS
     RECORDING MODE IS F.
 01  EMP-RECORD.
     03  EMP-ID           PIC X(05).
     03  EMP-NAME         PIC X(15).
     03  EMP-LOC          PIC X(03).
     03  EMP-DOB.
         05 EMP-DOB-YYYY  PIC X(04).
         05 EMP-DOB-MM    PIC X(02).
         05 EMP-DOB-DD    PIC X(02).
     03  EMP-TECH         PIC X(05).
     03  EMP-EARN         PIC 9(05)V99.
     03  EMP-DEDN         PIC 9(05)V99.
     
 FD  REPORT-FILE
     RECORD CONTAINS 80 CHARACTERS
     RECORDING MODE IS F.
 01  REPORT-RECORD        PIC X(80).
*
 WORKING-STORAGE SECTION.
 01  WS-EMP-STAT          PIC X(02).
     88  OPEN-EMP-SUCCESS            VALUE '00'.
 01  WS-EMP-FLAG          PIC X(01)  VALUE 'N'.
     88  END-EMP-FILE                VALUE 'Y'.
 01  WS-OUT-STAT          PIC X(02).
     88  OPEN-SUCCESS                VALUE '00'.
 01  WS-OUT-FLAG          PIC X(01)  VALUE 'N'.
     88  END-OF-FILE                 VALUE 'Y'.
*
 01  HEADING-LINE1.
     03  FILLER           PIC X(06)  VALUE 'DATE:'.
     03  P-DATE.
         05 WS-DATE-DD    PIC X(02)  VALUE ZERO.
         05 FILLER        PIC X(01)  VALUE '/'.
         05 WS-DATE-MM    PIC X(02)  VALUE ZERO.
         05 FILLER        PIC X(01)  VALUE '/'.
         05 WS-DATE-YYYY  PIC X(04)  VALUE ZERO.
     03  FILLER           PIC X(50)  VALUE SPACES.
     03  FILLER           PIC X(06)  VALUE 'DATE:'.
     03  P-TIME.
         05 WS-TIME-HH    PIC X(02)  VALUE ZERO.
         05 FILLER        PIC X(01)  VALUE ':'.
         05 WS-TIME-MM    PIC X(02)  VALUE ZERO.
         05 FILLER        PIC X(02)  VALUE ':'.
         05 WS-TIME-SS    PIC X(02)  VALUE ZERO.
*
 01  HEADING-LINE2.
     03  FILLER           PIC X(20)  VALUE 'LISTING OF EMPLOYEES'.
     03  FILLER           PIC X(46)  VALUE SPACES.
     03  FILLER           PIC X(06)  VALUE 'PAGE:'.
     03  PAGENO           PIC X(02)  VALUE '01'.
*
 01  HEADING-LINE3.
     03  FILLER           PIC X(05)  VALUE 'LOC: '.
     03  DISP-LOC         PIC X(03)  VALUE SPACES. 
     03  FILLER           PIC X(06)  VALUE 'TECH: '.
     03  DISP-TECH        PIC X(04)  VALUE SPACES. 
     03  FILLER           PIC X(62)  VALUE SPACES.
*     
 01  DETAIL-LINE.
     03  P-ID             PIC X(05)  VALUE SPACES.
     03  FILLER           PIC X(01)  VALUE SPACES.
     03  P-NAME           PIC X(15)  VALUE SPACES.
     03  FILLER           PIC X(01)  VALUE SPACES.
     03  P-LOC            PIC X(03)  VALUE SPACES.
     03  FILLER           PIC X(01)  VALUE SPACES.
     03  P-DOB.
         05 EMP-DOB-DD    PIC X(02)  VALUE ZERO.
         05 FILLER        PIC X(01)  VALUE '/'.
         05 EMP-DOB-MM    PIC X(02)  VALUE ZERO.
         05 FILLER        PIC X(01)  VALUE '/'.
         05 EMP-DOB-YYYY  PIC X(04)  VALUE ZERO.
     03  FILLER           PIC X(01)  VALUE SPACES.
     03  P-TECH           PIC X(05)  VALUE SPACES.
     03  FILLER           PIC X(01)  VALUE SPACES.
     03  P-EARN           PIC ZZZ,ZZ9.99 VALUE ZERO.
     03  FILLER           PIC X(01)  VALUE SPACES.
     03  P-DEDN           PIC ZZZ,ZZ9.99 VALUE ZERO.
     03  FILLER           PIC X(1)   VALUE SPACES.
     03  P-SAL            PIC ZZZ,ZZ9.99 VALUE ZERO.
*
 01  HEADING-LINE4.
     03  FILLER           PIC X(06)  VALUE 'ID'.
     03  FILLER           PIC X(16)  VALUE 'NAME'.
     03  FILLER           PIC X(04)  VALUE 'LOC'.
     03  FILLER           PIC X(11)  VALUE 'BIRTH DATE'.
     03  FILLER           PIC X(06)  VALUE 'TECH'.
     03  FILLER           PIC X(11)  VALUE '  EARNINGS '.
     03  FILLER           PIC X(11)  VALUE 'DEDUCTIONS '.
     03  FILLER           PIC X(10)  VALUE 'TOTAL SAL '.
* 
 01  PER-PAGE-DISPLAY.
     03  FILLER           PIC X(17)  VALUE 'NO OF EMPLOYEES: '.
     03  FILLER           PIC X(01)  VALUE SPACES.
     03  PAGE-EMP         PIC 9(02)  VALUE ZERO.
     03  FILLER           PIC X(23)  VALUE SPACES.
     03  PAGE-TOTAL-EARN  PIC ZZZ,ZZ9.99 VALUE ZERO.
     03  FILLER           PIC X(1)   VALUE SPACES.
     03  PAGE-TOTAL-DEDN  PIC ZZZ,ZZ9.99 VALUE ZERO.
     03  FILLER           PIC X(1)   VALUE SPACES.
     03  PAGE-TOTAL-SAL   PIC ZZZ,ZZ9.99 VALUE ZERO.
*     
 01  LAST-DISPLAY.
     03  FILLER           PIC X(17)  VALUE 'TOTAL EMPLOYEES: '.
     03  FILLER           PIC X(01)  VALUE SPACES.
     03  TOTAL-EMP        PIC 9(02)  VALUE ZERO.
     03  FILLER           PIC X(23)  VALUE SPACES.
     03  LAST-TOTAL-EARN  PIC ZZZ,ZZ9.99.
     03  FILLER           PIC X(1)   VALUE SPACES.
     03  LAST-TOTAL-DEDN  PIC ZZZ,ZZ9.99.
     03  FILLER           PIC X(1)   VALUE SPACES.
     03  LAST-TOTAL-SAL   PIC ZZZ,ZZ9.99.   
* 
 01  WS-COMPUTE.
     03 PAGE-EARN         PIC 9(06)V99 VALUE ZERO.
     03 PAGE-DEDN         PIC 9(06)V99 VALUE ZERO.
     03 PAGE-SAL          PIC 9(06)V99 VALUE ZERO.
     03 TOTAL-EARN        PIC 9(06)V99 VALUE ZERO.
     03 TOTAL-DEDN        PIC 9(06)V99 VALUE ZERO.
     03 TOTAL-SAL         PIC 9(06)V99 VALUE ZERO.
 01  PER-PAGE-EMP         PIC 9(02)    VALUE ZERO.
 01  LAST-TOTAL-EMP       PIC 9(02)    VALUE ZERO. 
* 
 01  WS-VARIABLES.
     03 WS-DATE                        VALUE ZERO.
        05 WS-DATE-YYYY   PIC 9(04).
        05 WS-DATE-MM     PIC 9(02).
        05 WS-DATE-DD     PIC 9(02).
     03 WS-TIME                        VALUE ZERO.
        05  WS-TIME-HH    PIC 9(02).
        05  WS-TIME-MM    PIC 9(02).
        05  WS-TIME-SS    PIC 9(02).
     03 PAGE-COUNT        PIC 9(02)    VALUE ZERO.
     03 LINE-COUNT        PIC 9(02)    VALUE 00.
     03 WS-SAL            PIC 9(06)V99 VALUE ZERO.
*     
*01  WS-TEMP.
*    03 TEMP-LOC          PIC X(03)    VALUE SPACES.
*    03 TEMP-TECH         PIC X(04)    VALUE SPACES.
*     
 PROCEDURE DIVISION.
 MAIN-PARA.
      PERFORM 1000-INIT-PARA  
      PERFORM 2500-HEADING-PARA
      PERFORM 2000-PROCESS-PARA  UNTIL  END-EMP-FILE
      PERFORM 9000-END-PARA
      STOP RUN.
*
 1000-INIT-PARA.
      OPEN INPUT EMPLOYEE-FILE
      OPEN OUTPUT REPORT-FILE
      DISPLAY WS-EMP-STAT
      DISPLAY WS-OUT-STAT
      IF OPEN-EMP-SUCCESS
      DISPLAY 'FILE HAS BEEN SUCCESSFULLY OPENED'
      END-IF
      PERFORM 1200-DATE-TIME-PARA.
      PERFORM 1500-READ-PARA.
*      MOVE EMP-LOC TO TEMP-LOC

*      MOVE EMP-TECH TO TEMP-TECH.
*
* 1111-SORT-PARA.
*     SORT WORK-FILE
*         ON ASCENDING KEY W-EMP-LOC
*         USING EMP-FILE
*         GIVING EMPLOYEE-FILE.
*
 1200-DATE-TIME-PARA.
      ACCEPT WS-DATE FROM DATE.
      ACCEPT WS-TIME FROM TIME.
      MOVE CORR WS-DATE TO P-DATE.
      MOVE CORR WS-TIME TO P-TIME.
*
 1500-READ-PARA.
      READ EMPLOYEE-FILE
      AT END
         MOVE 'Y' TO WS-EMP-FLAG
      NOT AT END
         ADD 1 TO TOTAL-EMP
      END-READ.
*
 2000-PROCESS-PARA.
      PERFORM 3000-MOVE-PARA.
      IF LINE-COUNT > 3
         PERFORM 4000-TOTAL-PARA
      END-IF
      WRITE REPORT-RECORD FROM DETAIL-LINE.
      ADD 1 TO LINE-COUNT.
      PERFORM 1500-READ-PARA.
*
 2500-HEADING-PARA.
      ADD 1 TO PAGE-COUNT
      MOVE ZERO TO LINE-COUNT
      MOVE PAGE-COUNT TO PAGENO 
      
      WRITE REPORT-RECORD FROM HEADING-LINE1
            AFTER ADVANCING PAGE
      WRITE REPORT-RECORD FROM HEADING-LINE2
      WRITE REPORT-RECORD FROM HEADING-LINE3
      WRITE REPORT-RECORD FROM HEADING-LINE4
            AFTER ADVANCING 2 LINES
      MOVE ZERO TO PAGE-TOTAL-EARN
      MOVE ZERO TO PAGE-TOTAL-DEDN
      MOVE ZERO TO PAGE-TOTAL-SAL
      MOVE ZERO TO PER-PAGE-EMP.
*
 3000-MOVE-PARA.
      MOVE EMP-ID         TO P-ID.
      MOVE EMP-NAME       TO P-NAME.
      MOVE EMP-LOC        TO P-LOC.
      MOVE EMP-TECH       TO P-TECH.
      MOVE EMP-EARN       TO P-EARN.
      MOVE EMP-DEDN       TO P-DEDN.
      MOVE CORR EMP-DOB   TO P-DOB.
      
      COMPUTE WS-SAL = EMP-EARN - EMP-DEDN
      MOVE WS-SAL TO P-SAL.
      
      ADD EMP-EARN        TO PAGE-EARN   
      ADD PAGE-EARN       TO TOTAL-EARN
      MOVE PAGE-EARN      TO PAGE-TOTAL-EARN
      MOVE TOTAL-EARN     TO LAST-TOTAL-EARN
             
      ADD EMP-DEDN        TO PAGE-DEDN   
      ADD PAGE-DEDN       TO TOTAL-DEDN
      MOVE PAGE-DEDN      TO PAGE-TOTAL-DEDN
      MOVE TOTAL-DEDN     TO LAST-TOTAL-DEDN
        
      ADD WS-SAL          TO PAGE-SAL   
      ADD PAGE-SAL        TO TOTAL-SAL
      MOVE PAGE-SAL       TO PAGE-TOTAL-SAL
      MOVE TOTAL-SAL      TO LAST-TOTAL-SAL      
      
      ADD 1               TO PER-PAGE-EMP       
      MOVE PER-PAGE-EMP   TO PAGE-EMP
      MOVE PER-PAGE-EMP   TO LAST-TOTAL-EMP
      
      ADD 1 TO LINE-COUNT.
*      
 4000-TOTAL-PARA.
      WRITE REPORT-RECORD FROM PER-PAGE-DISPLAY.   
      PERFORM 2500-HEADING-PARA
*      
 5000-TOTAL-PARA.
      WRITE REPORT-RECORD FROM LAST-DISPLAY.
*
 9000-END-PARA.
      PERFORM 4000-TOTAL-PARA
      PERFORM 5000-TOTAL-PARA
      CLOSE EMPLOYEE-FILE
      CLOSE REPORT-FILE.
