 IDENTIFICATION DIVISION.
 PROGRAM-ID. KSDS02.
 ENVIRONMENT DIVISION.
 INPUT-OUTPUT SECTION.
* 
 FILE-CONTROL.
     SELECT EMPLOYEE-MASTER ASSIGN TO 'EMPMAST.DAT'
         ORGANIZATION IS INDEXED
         ACCESS MODE  IS RANDOM
         RECORD KEY   IS EMP-ID
         FILE STATUS  IS WS-EMP-STAT.
     SELECT INPUT-FILE ASSIGN TO 'INPUT.DAT'
         ORGANIZATION IS SEQUENTIAL
         ACCESS MODE  IS SEQUENTIAL
         FILE STATUS  IS WS-INP-STAT.
     SELECT REPORT-FILE ASSIGN TO 'REPORT.REP'.
*         
 DATA DIVISION.
 FILE SECTION.
 FD  EMPLOYEE-MASTER
     RECORD CONTAINS 50 CHARACTERS.
 01  MASTER-RECORD.              
     03  EMP-ID       PIC X(05).   
     03  EMP-NAME     PIC X(15).   
     03  EMP-LOC      PIC X(03).   
     03  EMP-DOB      PIC X(08).   
     03  EMP-TECH     PIC X(05).   
     03  EMP-EARN     PIC 9(05)V99.
     03  EMP-DEDN     PIC 9(05)V99.     

 FD  INPUT-FILE     
     RECORD CONTAINS 5 CHARACTERS
     RECORDING MODE IS F.
 01  INPUT-RECORD     PIC X(05).
 
 FD  REPORT-FILE
     RECORD CONTAINS 80 CHARACTERS
     RECORDING MODE IS F.
 01  REPORT-RECORD PIC X(80).
* 
 WORKING-STORAGE SECTION.
 01  WS-VARIABLES.
     03  WS-FILE-FLAG     PIC X(01)      VALUE 'N'.
         88  END-OF-FILE                 VALUE 'Y'.
     03  WS-EMP-FLAG      PIC X(01)      VALUE 'N'.
         88  EMP-FOUND                   VALUE 'Y'.
     03  TOT-RECS         PIC 9(02)      VALUE ZERO.
     03  EMP-VALID        PIC 9(02)      VALUE ZERO.
     03  EMP-INVALID      PIC 9(02)      VALUE ZERO.
     03  WS-EMP-STAT      PIC X(02)      VALUE SPACES.
     03  WS-INP-STAT      PIC X(02)      VALUE SPACES.
* 
 01  HEADING-LINE.
     03  FILLER           PIC X(06)      VALUE 'ID'.
     03  FILLER           PIC X(16)      VALUE 'NAME'.
     03  FILLER           PIC X(04)      VALUE 'LOC'.
     03  FILLER           PIC X(11)      VALUE 'BIRTH DATE'.
     03  FILLER           PIC X(05)      VALUE 'TECH'.
     03  FILLER           PIC X(10)      VALUE 'EARNINGS '.
     03  FILLER           PIC X(11)      VALUE 'DEDUCTIONS '.
* 
 01  DETAIL-LINE.
     03  P-ID             PIC X(05)      VALUE SPACES.
     03  FILLER           PIC X(01)      VALUE SPACES.
     03  P-NAME           PIC X(15)      VALUE SPACES.
     03  FILLER           PIC X(01)      VALUE SPACES.
     03  P-LOC            PIC X(03)      VALUE SPACES.
     03  FILLER           PIC X(01)      VALUE SPACES.
     03  P-DOB            PIC X(10)      VALUE SPACES.
     03  FILLER           PIC X(01)      VALUE SPACES.
     03  P-TECH           PIC X(04)      VALUE SPACES.
     03  FILLER           PIC X(01)      VALUE SPACES.
     03  P-EARN           PIC ZZ,ZZ9.99  VALUE ZERO.
     03  FILLER           PIC X(02)      VALUE SPACES.
     03  P-DEDN           PIC ZZ,ZZ9.99  VALUE ZERO.
*
 01  INVALID-RECS.
     03  FILLER           PIC X(16)      VALUE 'INVALID EMP ID: '.
     03  INVAL-ID         PIC X(05)      VALUE ZERO.
*     
 01  COUNT-RECORDS.
     03  FILLER           PIC X(15)      VALUE 'TOTAL RECORDS: '.
     03  COUNT-TOTAL      PIC 9(02)      VALUE ZERO.
     03  FILLER           PIC X(05)      VALUE SPACES.  
     03  FILLER           PIC X(11)      VALUE 'VALID IDS: '.
     03  COUNT-VALID      PIC 9(02)      VALUE ZERO.
     03  FILLER           PIC X(05)      VALUE SPACES.
     03  FILLER           PIC X(13)      VALUE 'INVALID IDS: '.
     03  COUNT-INVALID    PIC 9(05)      VALUE ZERO.
*         
 01  PRINT-LINE1.
     03  FILLER           PIC X(63)      VALUE ALL '-'.
 01  PRINT-LINE2.
     03  FILLER           PIC X(63)      VALUE ALL '='.
*     
 01  VARIABLES.
     03  COUNTER          PIC 9(02)      VALUE ZERO.
     03  LOC              PIC 9(01)      VALUE ZERO.
     03  TEMP             PIC 9(05)      VALUE ZERO.
     03  INVALID-ID       PIC X(50)      VALUE ZERO.
     03  FILLER REDEFINES INVALID-ID.
         05  IDS          PIC X(05)      OCCURS 10 TIMES.
*     
 PROCEDURE DIVISION.
 0000-MAIN-PARA.
     PERFORM 1000-INIT-PARA.
     PERFORM 2000-PROCESS-PARA  UNTIL  END-OF-FILE
     PERFORM 9000-END-PARA
     STOP RUN.
* 
 1000-INIT-PARA.
     OPEN INPUT EMPLOYEE-MASTER
     DISPLAY 'EMP OPEN FS ', WS-EMP-STAT
     OPEN INPUT INPUT-FILE.
     DISPLAY 'REP OPEN FS ', WS-INP-STAT
     OPEN OUTPUT REPORT-FILE
     PERFORM 1500-READ-PARA
     WRITE REPORT-RECORD FROM HEADING-LINE
     WRITE REPORT-RECORD FROM PRINT-LINE1.
* 
 1500-READ-PARA.
     READ INPUT-FILE
        AT END
           MOVE 'Y' TO WS-FILE-FLAG
        NOT AT END
           ADD 1 TO TOT-RECS
     END-READ.
*
 2000-PROCESS-PARA.
     PERFORM 2500-READ-MASTER
     IF EMP-FOUND
         PERFORM 3000-DISPLAY-PARA
     ELSE    
         ADD 1 TO EMP-INVALID     
         MOVE INPUT-RECORD TO INVALID-ID 
     END-IF
     PERFORM 1500-READ-PARA.
*
 2500-READ-MASTER.
     MOVE INPUT-RECORD TO EMP-ID
     READ EMPLOYEE-MASTER
         INVALID KEY
             MOVE 'N' TO WS-EMP-FLAG
         NOT INVALID KEY
             MOVE 'Y' TO WS-EMP-FLAG
     END-READ.
* 
 9000-END-PARA.
     PERFORM 5000-COUNT-PARA
     CLOSE EMPLOYEE-MASTER, INPUT-FILE.
*
 3000-DISPLAY-PARA.
     MOVE  EMP-ID        TO   P-ID
     MOVE  EMP-NAME      TO   P-NAME
     MOVE  EMP-LOC       TO   P-LOC
     MOVE  EMP-DOB(1:4)  TO   P-DOB(7:4)
     MOVE  EMP-DOB(5:2)  TO   P-DOB(4:2)
     MOVE  EMP-DOB(7:2)  TO   P-DOB(1:2)
     MOVE  '/'           TO   P-DOB(3:1)
                              P-DOB(6:1)
     MOVE  EMP-TECH      TO   P-TECH
     MOVE  EMP-EARN      TO   P-EARN
     MOVE  EMP-DEDN      TO   P-DEDN
     ADD   1             TO   EMP-VALID 
     WRITE REPORT-RECORD FROM DETAIL-LINE.
* 
 4000-INVALID-PARA.
     ADD 1 TO COUNTER
     WRITE REPORT-RECORD FROM PRINT-LINE2  
     PERFORM 4500-INVALID-PARA UNTIL COUNTER = COUNT-INVALID 
     WRITE REPORT-RECORD FROM PRINT-LINE2.
*     
 4500-INVALID-PARA.
     MOVE COUNT-INVALID TO TEMP
     MULTIPLY TEMP BY 5 GIVING TEMP
     SUBTRACT 4 FROM TEMP GIVING LOC
     MOVE INVALID-ID(LOC:5) TO IDS 
     MOVE IDS TO INVAL-ID
     WRITE REPORT-RECORD FROM INVALID-RECS.
* 
 5000-COUNT-PARA.
     MOVE  TOT-RECS      TO   COUNT-TOTAL
     MOVE  EMP-VALID     TO   COUNT-VALID
     MOVE  EMP-INVALID   TO   COUNT-INVALID
     PERFORM 4000-INVALID-PARA
     WRITE REPORT-RECORD FROM COUNT-RECORDS
     WRITE REPORT-RECORD FROM PRINT-LINE2.
*
