 IDENTIFICATION DIVISION.
 PROGRAM-ID. KSDSCRTE.
 ENVIRONMENT DIVISION.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
     SELECT EMP-FILE-IN   ASSIGN TO 'EMPFILE.DAT'.
     SELECT WORK-FILE     ASSIGN TO 'WORKFILE.DAT'.
     SELECT EMPLOYEE-FILE ASSIGN TO 'TEMPFILE.DAT'
        ORGANIZATION IS SEQUENTIAL
        ACCESS MODE  IS SEQUENTIAL
        FILE STATUS  IS WS-EMP-STAT.
     SELECT EMPLOYEE-MASTER ASSIGN TO 'EMPMAST.DAT'
        ORGANIZATION IS INDEXED
        ACCESS MODE  IS SEQUENTIAL
        RECORD KEY   IS EMP-ID
        FILE STATUS  IS WS-MAST-STAT.
 DATA DIVISION.
 FILE SECTION.
 FD  EMP-FILE-IN
     RECORD CONTAINS 50 CHARACTERS
     RECORDING MODE IS F.
 01  EMP-RECORD.
     03  IN-EMP-ID       PIC X(05).
     03  FILLER          PIC X(45).
 SD  WORK-FILE.
 01  WORK-RECORD.
     03  W-EMP-ID        PIC X(05).
     03  FILLER          PIC X(45).
 FD  EMPLOYEE-FILE
     RECORD CONTAINS 50 CHARACTERS
     RECORDING MODE IS F.
 01  EMPLOYEE-RECORD  PIC X(50).              
 FD  EMPLOYEE-MASTER
     RECORD CONTAINS 50 CHARACTERS
     RECORDING MODE IS F.
 01  MASTER-RECORD.
     03  EMP-ID       PIC X(05).   
     03  EMP-NAME     PIC X(15).   
     03  EMP-LOC      PIC X(03).   
     03  EMP-DOB      PIC X(08).   
     03  EMP-TECH     PIC X(05).   
     03  EMP-EARN     PIC 9(05)V99.
     03  EMP-DEDN     PIC 9(05)V99.     
 WORKING-STORAGE SECTION.
 01  WS-VARIABLES.
     03  WS-FILE-FLAG     PIC X(01) VALUE 'N'.
         88  END-OF-FILE            VALUE 'Y'.
     03  WS-EMP-STAT      PIC X(02) VALUE SPACES.
     03  WS-MAST-STAT     PIC X(02) VALUE SPACES.
     03  RECS-READ        PIC 9(02) VALUE ZERO.
     03  RECS-WRITTEN     PIC 9(02) VALUE ZERO.
 PROCEDURE DIVISION.
 0000-MAIN-PARA.
     PERFORM 1000-INIT-PARA.
     PERFORM 2000-PROCESS-PARA  UNTIL  END-OF-FILE
     PERFORM 9000-END-PARA
     STOP RUN.
 1000-INIT-PARA.
     PERFORM 1111-SORT-PARA
     OPEN INPUT EMPLOYEE-FILE
     DISPLAY 'EMP OPEN FS ', WS-EMP-STAT
     OPEN OUTPUT EMPLOYEE-MASTER.
     DISPLAY 'REP OPEN FS ', WS-MAST-STAT
     PERFORM 1500-READ-PARA.
 1111-SORT-PARA.
     SORT WORK-FILE
        ON ASCENDING KEY W-EMP-ID
           USING EMP-FILE-IN
           GIVING EMPLOYEE-FILE.
 1500-READ-PARA.
     READ EMPLOYEE-FILE
        AT END
           MOVE 'Y' TO WS-FILE-FLAG
        NOT AT END
           ADD 1 TO RECS-READ
     END-READ.
 2000-PROCESS-PARA.
     WRITE MASTER-RECORD FROM EMPLOYEE-RECORD
     ADD 1 TO RECS-WRITTEN
     PERFORM 1500-READ-PARA.
 9000-END-PARA.
     DISPLAY '==========================='
     DISPLAY 'RECS READ    = ', RECS-READ
     DISPLAY 'RECS WRITTEN = ', RECS-WRITTEN
     CLOSE EMPLOYEE-FILE, EMPLOYEE-MASTER.
